[["FOOD NOT PROTECTED DURING STORAGE, PREPARATION, DISPLAY, TRANSPORTATION AND SERVICE, FROM POTENTIAL SOURCES OF CONTAMINATION (E.G., FOOD UNCOVERED, MISLABELED, STORED ON FLOOR, MISSING OR INADEQUATE SNEEZE GUARDS, FOOD CONTAINERS DOUBLE STACKED)", 3008], [" FLOORS, WALLS, CEILINGS, NOT SMOOTH, PROPERLY CONSTRUCTED, IN DISREPAIR, DIRTY SURFACES", 2274], [" LIGHTING AND VENTILATION INADEQUATE, FIXTURES NOT SHIELDED, DIRTY VENTILATION HOODS, DUCTWORK, FILTERS, EXHAUST FANS", 1968], [" NON-FOOD CONTACT SURFACES AND EQUIPMENT ARE IMPROPERLY DESIGNED, CONSTRUCTED, INSTALLED, MAINTAINED (EQUIPMENT NOT READILY ACCESSIBLE FOR CLEANING, SURFACE NOT SMOOTH FINISH)", 1673], ["ACCURATE THERMOMETERS NOT AVAILABLE OR USED TO EVALUATE REFRIGERATED OR HEATED STORAGE TEMPERATURES", 1650], [" NON FOOD CONTACT SURFACES OF EQUIPMENT NOT CLEAN", 1363], [" WIPING CLOTHS DIRTY, NOT STORED PROPERLY IN SANITIZING SOLUTIONS", 1295], ["MISCELLANEOUS, ECONOMIC VIOLATION, CHOKING POSTER, TRAINING.", 932], [" HANDWASHING FACILITIES INACCESSIBLE, IMPROPERLY LOCATED, DIRTY, IN DISREPAIR, IMPROPER FIXTURES, SOAP, AND SINGLE SERVICE TOWELS OR HAND DRYING DEVICES MISSING", 891], [" PLUMBING AND SINKS NOT PROPERLY SIZED, INSTALLED, MAINTAINED; EQUIPMENT AND FLOORS NOT PROPERLY DRAINED", 846], [" EFFECTIVE MEASURES NOT USED TO CONTROL ENTRANCE (RODENT-, INSECT-PROOF CONTRUCTION). HARBORAGE AREAS AVAILABLE FOR RODENTS, INSECTS AND OTHER VERMIN", 840], [" INSECTS, RODENTS PRESENT", 799], [" FOOD CONTACT SURFACES NOT WASHED, RINSED AND SANITIZED AFTER EACH USE AND FOLLOWING ANY TIME OF OPERATIONS WHEN CONTAMINATION MAY HAVE OCCURRED", 750], ["IN USE FOOD DISPENSING UTENSILS IMPROPERLY STORED", 570], [" MANUAL FACILITIES INADEQUATE, TECHNIQUE INCORRECT; MECHANICAL FACILITIES NOT OPERATED IN ACCORDANCE WITH MANUFACTURER'S INSTRUCTIONS", 556], ["IMPROPER USE AND STORAGE OF CLEAN, SANITIZED EQUIPMENT AND UTENSILS", 526], ["TOBACCO IS USED; EATING, DRINKING IN FOOD PREPARATION, DISHWASHING FOOD STORAGE AREAS", 443], [" TOILET FACILITIES INADEQUATE, INCONVENIENT, DIRTY, IN DISREPAIR, TOILET PAPER MISSING, NOT SELF-CLOSING DOORS, MISSING HAND WASH SIGNS", 404], ["POTENTIALLY HAZARDOUS FOODS ARE NOT KEPT AT OR BELOW 45OF DURING COLD HOLDING, EXCEPT SMOKED FISH NOT KEPT AT OR BELOW 38OF DURING COLD HOLDING.", 390], [" FOOD (ICE) CONTACT SURFACES ARE IMPROPERLY DESIGNED, CONSTRUCTED, INSTALLED, LOCATED (CRACKS, OPEN SEAMS, PITTED SURFACES, TIN CANS REUSED, UNCLEANABLE OR CORRODED FOOD CONTACT SURFACES)", 368], ["SINGLE SERVICE ITEMS REUSED, IMPROPERLY STORED, DISPENSED, NOT USED WHEN REQUIRED", 314], [" PESTICIDE APPLICATION NOT SUPERVISED BY A CERTIFIED APPLICATOR", 297], ["POTENTIALLY HAZARDOUS FOODS ARE NOT KEPT AT OR ABOVE 140OF DURING HOT HOLDING.", 289], [" PREMISES LITTERED, UNNECESSARY EQUIPMENT AND ARTICLE PRESENT, LIVING QUARTERS NO COMPLETELY SEPARATED FOR FOOD SERVICE OPERATIONS, LIVE ANIMALS, BIRDS AND PETS NOT EXCLUDED", 265], ["IMPROPER THAWING PROCEDURES USED", 221], ["ACCURATE THERMOMETERS NOT AVAILABLE OR USED TO EVALUATE POTENTIALLY HAZARDOUS FOOD TEMPERATURES DURING COOKING, COOLING, REHEATING AND HOLDING.", 203], ["POTENTIALLY HAZARDOUS FOODS ARE NOT COOLED BY AN APPROVED METHOD WHERE THE FOOD TEMPERATURE CAN BE REDUCED FROM 120OF TO 70OF OR LESS WITHIN TWO HOURS AND 70OF TO 45OF WITHIN FOUR HOURS.", 159], ["ENOUGH REFRIGERATED STORAGE EQUIPMENT IS NOT PRESENT, PROPERLY DESIGNED, MAINTAINED OR OPERATED SO THAT ALL POTENTIALLY HAZARDOUS FOODS ARE COOLED PROPERLY AND STORED BELOW 45OF AS REQUIRED.", 153], ["COOKED OR PREPARED FOODS ARE SUBJECT TO CROSS-CONTAMINATION FROM RAW FOODS.", 129], ["POTENTIALLY HAZARDOUS FOODS ARE NOT STORED UNDER REFRIGERATION EXCEPT DURING NECESSARY PREPARATION OR APPROVED PRECOOLING PROCEDURES (ROOM TEMPERATURE STORAGE).", 124], ["FOOD WORKERS DO NOT USE PROPER UTENSILS TO ELIMINATE BARE HAND CONTACT WITH COOKED OR PREPARED FOODS.", 116], ["FOOD FROM UNAPPROVED SOURCE, SPOILED, ADULTERATED ON PREMISES.", 110], ["WATER/ICE: UNSAFE, UNAPPROVED SOURCES, CROSS CONNECTIONS", 108], [" HOT, COLD RUNNING WATER NOT PROVIDED, PRESSURE INADEQUATE", 85], ["DRESSING ROOMS DIRTY, NOT PROVIDED, IMPROPERLY LOCATED", 81], ["PRECOOKED, REFRIGERATED POTENTIALLY HAZARDOUS FOOD IS NOT REHEATED TO 165OF OR ABOVE WITHIN TWO HOURS.", 76], ["HAIR IS IMPROPERLY RESTRAINED", 60], ["CANNED FOODS FOUND IN POOR CONDITIONS (LEAKERS, SEVERE DENTS, RUSTY, SWOLLEN CANS)", 60], ["TOXIC CHEMICALS ARE IMPROPERLY LABELED, STORED OR USED SO THAT CONTAMINATION OF FOOD CAN OCCUR.", 58], [" GARBAGE STORAGE AREAS NOT PROPERLY CONSTRUCTED OR MAINTAINED, CREATING A NUISANCE", 52], [" IMPROPER STORAGE OF CLEANING EQUIPMENT, LINENS, LAUNDRY UNACCEPTABLE", 33], ["RAW FOODS NOT PROPERLY WASHING PRIOR TO SERVING", 32], ["POTENTIALLY HAZARDOUS FOODS SUCH AS SALADS PREPARED FROM POTATOES OR MACARONI ARE NOT PREPARED AS RECOMMENDED USING PRECHILLED INGREDIENTS AND NOT  PRECHILLED TO 45OF OR LESS AS RECOMMENDED BEFORE THEY ARE STORED ON BUFFET LINES.", 29], [" IMPROPERLY FUNCTIONING ON-SITE SEWAGE DISPOSAL SYSTEM, IMPROPER", 27], ["FOOD WORKERS DO NOT WASH HANDS THOROUGHLY AFTER VISITING THE TOILET, COUGHING, SNEEZING, SMOKING OR OTHERWISE CONTAMINATING THEIR HANDS.", 25], ["ALL POULTRY, POULTRY STUFFINGS, STUFFED MEATS AND STUFFINGS CONTAINING MEAT ARE NOT HEATED TO 165OF OR ABOVE.", 21], [" ADEQUATE, LEAKPROOF, NON-ABSORBENT, VERMIN-PROOF, COVERED CONTAINERS NOT PROVIDED WHERE NEEDED", 19], ["SHELLFISH NOT FROM APPROVED SOURCES, IMPROPERLY TAGGED/LABELED, TAGS NOT  RETAINED 90 DAYS.", 18], ["FOOD WORKERS PREPARE RAW AND COOKED OR READY TO EAT FOOD PRODUCTS WITHOUT 'THOROUGH HANDWASHING AND SANITARY GLOVE CHANGING IN BETWEEN.", 18], ["PREPARED FOOD PRODUCTS CONTACT EQUIPMENT OR WORK SURFACES WHICH HAVE HAD PRIOR CONTACT WITH RAW FOODS AND WHERE WASHING AND SANITIZING OF THE FOOD CONTACT SURFACE HAS NOT OCCURRED TO PREVENT CONTAMINATION", 13], ["ENOUGH HOT HOLDING EQUIPMENT IS NOT PRESENT, PROPERLY DESIGNED, MAINTAINED AND OPERATED TO KEEP HOT FOODS ABOVE 140OF.", 12], ["INADEQUATE PERSONAL CLEANLINESS", 9], ["HOME CANNED GOODS, OR CANNED GOODS FROM UNAPPROVED PROCESSOR FOUND  ON PREMISES", 7], ["COMMERCIALLY PROCESSED PRECOOKED POTENTIALLY HAZARDOUS FOODS ARE NOT HEATED TO 140OF OR ABOVE WITHIN TWO HOURS.", 6], ["FOODS OR FOOD AREA/PUBLIC AREA CONTAMINATION BY SEWAGE OR DRIPPAGE FROM WASTE LINES.", 5], ["CRACKED/DIRTY FRESH EGGS, LIQUID OR FROZEN EGGS AND POWDERED EGGS NOT PASTEURIZED.", 5], ["OTHER POTENTIALLY HAZARDOUS FOODS REQUIRING COOKING ARE NOT HEATED TO 140OF OR ABOVE.", 4], ["MEAT AND MEAT PRODUCTS NOT FROM APPROVED PLANTS.", 3], ["ALL GROUND MEAT AND FOODS CONTAINING GROUND MEAT ARE NOT HEATED TO 158OF OR ABOVE EXCEPT BY CONSUMER REQUEST.", 3], ["UNPASTEURIZED MILK AND MILK PRODUCTS USED", 2], ["FOOD WORKERS PREPARE FOODS WHEN ILL WITH A DISEASE TRANSMISSIBLE BY FOODS SUCH AS: DIARRHEA, HEPATITIS, ACUTE RESPIRATORY INFECTIONS, VOMITING OR HAVE INFECTED CUTS OR BURNS ON THEIR HANDS.", 1], ["WHOLE FROZEN POULTRY OR POULTRY BREASTS, OTHER THAN A SINGLE PORTION, ARE BEING COOKED FROZEN OR PARTIALLY THAWED.", 1]]